packages/Webkul/Shop/src/Support/TikStoreProductDummyDisplay.php

select * from `product_flat` where `product_id` = 1 and `channel` = 'default' and `locale` = 'en' and `parent_id` is null limit 1
---
    protected function getProductFlatRow(int $productId): ?object
    {
        $channel = core()->getCurrentChannelCode();
        $locale = app()->getLocale();

        return DB::table('product_flat')
            ->where('product_id', $productId)
            ->where('channel', $channel)
            ->where('locale', $locale)
            ->whereNull('parent_id')
            ->first();