packages/Webkul/Admin/src/Http/Controllers/Seller/FinancialStatementController.php

    public function index()
    {
        /** @var Admin $seller */
        $seller = Auth::guard('admin')->user();

        $period = request()->query('period', 'today');

        [$start, $end] = $this->resolvePeriodRange($period);

        $base = Order::query()
            ->where('seller_id', $seller->id)
            ->where('seller_approval_status', 'approved');

        if ($start && $end) {
            $base->whereBetween('created_at', [$start, $end]);
        }

        $pendingStatuses = [
            Order::STATUS_PENDING,
            Order::STATUS_PENDING_PAYMENT,
            Order::STATUS_PROCESSING,
        ];

        $completedStatuses = [
            Order::STATUS_COMPLETED,
            Order::STATUS_CLOSED,
        ];

        $pendingAmount = (float) (clone $base)->whereIn('status', $pendingStatuses)->sum('grand_total');
        $totalSales = (float) (clone $base)->whereIn('status', $completedStatuses)->sum('grand_total');
        $totalOrders = (int) (clone $base)->count();
---
select sum(`grand_total`) as aggregate from `orders` where `seller_id` = 3 and `seller_approval_status` = 'approved' and `created_at` between '2026-05-12 00:00:00' and '2026-05-12 23:59:59' and `status` in ('pending', 'pending_payment', 'processing')
select sum(`grand_total`) as aggregate from `orders` where `seller_id` = 3 and `seller_approval_status` = 'approved' and `created_at` between '2026-05-12 00:00:00' and '2026-05-12 23:59:59' and `status` in ('completed', 'closed')
select count(*) as aggregate from `orders` where `seller_id` = 3 and `seller_approval_status` = 'approved' and `created_at` between '2026-05-12 00:00:00' and '2026-05-12 23:59:59'

        $margin = (float) config('seller-panel.financial_profit_margin', 0.35);
        $totalProfit = round($totalSales * $margin, 2);

        $dailyRows = Order::query()
            ->where('seller_id', $seller->id)
            ->where('seller_approval_status', 'approved')
            ->when($start && $end, fn ($q) => $q->whereBetween('created_at', [$start, $end]))
            ->select([
                DB::raw('DATE(created_at) as statement_date'),
                DB::raw('COUNT(*) as orders_count'),
                DB::raw("SUM(CASE WHEN status IN ('".Order::STATUS_COMPLETED."', '".Order::STATUS_CLOSED."') THEN grand_total ELSE 0 END) as completed_revenue"),
                DB::raw("SUM(CASE WHEN status IN ('".Order::STATUS_PENDING."', '".Order::STATUS_PENDING_PAYMENT."', '".Order::STATUS_PROCESSING."') THEN grand_total ELSE 0 END) as pending_revenue"),
            ])
            ->groupBy('statement_date')
            ->orderBy('statement_date', 'desc')
            ->get()
            ->map(function ($row) use ($margin) {
                $completedRevenue = (float) $row->completed_revenue;
                $pendingRevenue = (float) $row->pending_revenue;

                return (object) [
                    'date' => $row->statement_date,
                    'orders_count' => (int) $row->orders_count,
                    'sales' => $completedRevenue,
                    'pending_amount' => $pendingRevenue,
                    'profit' => round($completedRevenue * $margin, 2),
                ];
            });
---
select DATE(created_at) as statement_date, COUNT(*) as orders_count, SUM(CASE WHEN status IN ('completed', 'closed') THEN grand_total ELSE 0 END) as completed_revenue, SUM(CASE WHEN status IN ('pending', 'pending_payment', 'processing') THEN grand_total ELSE 0 END) as pending_revenue from `orders` where `seller_id` = 3 and `seller_approval_status` = 'approved' and `created_at` between '2026-05-12 00:00:00' and '2026-05-12 23:59:59' group by `statement_date` order by `statement_date` desc