packages/Webkul/Admin/src/Http/Controllers/Seller/ProductWarehouseController.php

        $sellerExistingProductIds = [];

        if (! empty($debugPageIds)) {
            $sellerExistingProductIds = DB::table('seller_store_products')
                ->where('seller_id', $seller->id)
                ->whereIn('product_id', $debugPageIds)
                ->pluck('product_id')
                ->map(fn ($id) => (int) $id)
                ->values()
                ->all();
---
select `product_id` from `seller_store_products` where `seller_id` = 3 and `product_id` in (280917, 280919, 280922, 280923, 280924, 280925, 280926, 280927, 280928, 280929)

    protected function countTotalWarehouseCatalogProducts(): int
    {
        $locale = app()->getLocale();
        $channel = core()->getCurrentChannelCode();
        $sellerId = (int) auth()->guard('admin')->id();

        $q = DB::table('product_flat')
            ->where('locale', $locale)
            ->where('channel', $channel)
            ->where('status', 1)
            ->where('visible_individually', 1);

        if ($sellerId > 0) {
            $q->whereNotExists(function ($sub) use ($sellerId) {
                $sub->select(DB::raw(1))
                    ->from('seller_store_products as ssp')
                    ->whereColumn('ssp.product_id', 'product_flat.product_id')
                    ->where('ssp.seller_id', $sellerId);
            });
        }

        return (int) $q->distinct()->count('product_flat.product_id');
---
select count(distinct `product_flat`.`product_id`) as aggregate from `product_flat` where `locale` = 'en' and `channel` = 'default' and `status` = 1 and `visible_individually` = 1 and not exists (select 1 from `seller_store_products` as `ssp` where `ssp`.`product_id` = `product_flat`.`product_id` and `ssp`.`seller_id` = 3)