packages/Webkul/Admin/src/Http/Controllers/Seller/SellerShopOrderController.php

insert into `seller_wallet_transactions` (`seller_id`, `amount`, `type`, `status`, `kind`, `order_id`, `description`, `balance_before`, `balance_after`, `updated_at`, `created_at`) values (3, 97.77, 'debit', 'completed', 'seller_purchase', 11, 'Purchase for order #11', 339.97, 242.2, '2026-05-08 12:39:20', '2026-05-08 12:39:20')
---
    protected function applyMakeOrderToOrder(Admin $seller, Order $order): ?JsonResponse
    {
        if ((int) $order->seller_id !== (int) $seller->id) {
            return new JsonResponse(['message' => __('admin::app.seller.shop-order.forbidden-order')], 403);
        }

        if ($order->seller_make_order_at) {
            return new JsonResponse(['message' => __('admin::app.seller.shop-order.already-made')], 422);
        }

        if (! $seller->isSellerAccountActive()) {
            return new JsonResponse(['message' => __('admin::app.seller.shop-order.account-inactive')], 422);
        }

        if ((int) $seller->credit_score !== 100) {
            return new JsonResponse(['message' => __('admin::app.seller.shop-order.credit-not-100-contact')], 422);
        }

        $amount = (float) $order->base_grand_total;
        $balanceBefore = (float) ($seller->wallet_balance ?? 0);

        if ($balanceBefore < $amount) {
            return new JsonResponse(['message' => __('admin::app.seller.shop-order.insufficient-balance-recharge')], 422);
        }

        $balanceAfter = $balanceBefore - $amount;

        SellerWalletTransaction::create([
            'seller_id' => $seller->id,
            'amount' => $amount,
            'type' => 'debit',
            'status' => SellerWalletTransaction::STATUS_COMPLETED,
            'kind' => SellerWalletTransaction::KIND_SELLER_PURCHASE,
            'order_id' => $order->id,
            'description' => __('admin::app.seller.shop-order.purchase-desc', ['increment' => $order->increment_id]),
            'balance_before' => $balanceBefore,
            'balance_after' => $balanceAfter,
        ]);