packages/Webkul/Admin/src/Http/Controllers/Seller/SellerStoreProductsController.php

    public function index()
    {
        if (request()->ajax()) {
            return datagrid(SellerStoreProductDataGrid::class)->process();
        }

        $categoryFilterOptions = $this->categoryFilterOptions();

        /** @var Admin $seller */
        $seller = auth()->guard('admin')->user();
        $storeProductsTotalCount = SellerStoreProduct::query()
            ->where('seller_id', (int) $seller->id)
            ->count();
---
select count(*) as aggregate from `seller_store_products` where `seller_id` = 3

    protected function categoryFilterOptions()
    {
        $locale = app()->getLocale();
        $channel = core()->getCurrentChannel();

        $query = DB::table('category_translations')
            ->join('categories', 'categories.id', '=', 'category_translations.category_id')
            ->where('category_translations.locale', $locale)
            ->orderBy('category_translations.name')
            ->select('categories.id as category_id', 'category_translations.name');

        if (Schema::hasTable('category_channels')) {
            $query->join('category_channels', 'categories.id', '=', 'category_channels.category_id')
                ->where('category_channels.channel_id', $channel->id);
        }

        return $query->get();
---
select `categories`.`id` as `category_id`, `category_translations`.`name` from `category_translations` inner join `categories` on `categories`.`id` = `category_translations`.`category_id` where `category_translations`.`locale` = 'en' order by `category_translations`.`name` asc

    public function modalData(SellerStoreProduct $sellerStoreProduct): JsonResponse
    {
        $this->authorizeSellerStoreProduct($sellerStoreProduct);

        /** @var Admin $seller */
        $seller = auth()->guard('admin')->user();
        $rule = SellerCommissionPercentRules::forLevel($seller->seller_level ?? null);

        $sellerStoreProduct->load('product');
        $flatStatus = DB::table('product_flat')
            ->where('product_id', (int) $sellerStoreProduct->product_id)
            ->where('locale', app()->getLocale())
            ->where('channel', core()->getCurrentChannelCode())
            ->value('status');
---
select * from `products` where `products`.`id` in (280913)
select `status` from `product_flat` where `product_id` = 1 and `locale` = 'en' and `channel` = 'default' limit 1