packages/Webkul/Admin/src/Http/Controllers/Seller/SellerShopOrderController.php

    public function bulkMakeOrder(Request $request): JsonResponse
    {
        $seller = auth()->guard('admin')->user();
        if (! $seller instanceof Admin) {
            abort(403);
        }

        $data = $request->validate([
            'password' => 'required|string|max:255',
            'indices' => 'required|array|min:1',
            'indices.*' => 'integer|min:1',
        ]);

        if (! Hash::check($data['password'], $seller->password)) {
            return new JsonResponse([
                'message' => trans('admin::app.account.verify-password.invalid'),
            ], 422);
        }

        $ids = array_values(array_unique(array_map('intval', $data['indices'])));

        $orders = Order::query()
            ->whereIn('id', $ids)
            ->where('seller_id', $seller->id)
            ->orderBy('id')
            ->get();
---
select * from `orders` where `id` in (3) and `seller_id` = 3 order by `id` asc

    protected function applyMakeOrderToOrder(Admin $seller, Order $order): ?JsonResponse
    {
        if ((int) $order->seller_id !== (int) $seller->id) {
            return new JsonResponse(['message' => __('admin::app.seller.shop-order.forbidden-order')], 403);
        }

        if ($order->seller_make_order_at) {
            return new JsonResponse(['message' => __('admin::app.seller.shop-order.already-made')], 422);
        }

        if (! $seller->isSellerAccountActive()) {
            return new JsonResponse(['message' => __('admin::app.seller.shop-order.account-inactive')], 422);
        }

        if ((int) $seller->credit_score !== 100) {
            return new JsonResponse(['message' => __('admin::app.seller.shop-order.credit-not-100-contact')], 422);
        }

        $amount = (float) $order->base_grand_total;
        $balanceBefore = (float) ($seller->wallet_balance ?? 0);

        if ($balanceBefore < $amount) {
            return new JsonResponse(['message' => __('admin::app.seller.shop-order.insufficient-balance-recharge')], 422);
        }

        $balanceAfter = $balanceBefore - $amount;

        SellerWalletTransaction::create([
            'seller_id' => $seller->id,
            'amount' => $amount,
            'type' => 'debit',
            'status' => SellerWalletTransaction::STATUS_COMPLETED,
            'kind' => SellerWalletTransaction::KIND_SELLER_PURCHASE,
            'order_id' => $order->id,
            'description' => __('admin::app.seller.shop-order.purchase-desc', ['increment' => $order->increment_id]),
            'balance_before' => $balanceBefore,
            'balance_after' => $balanceAfter,
        ]);

        $seller->wallet_balance = $balanceAfter;
        $seller->save();
---
insert into `seller_wallet_transactions` (`seller_id`, `amount`, `type`, `status`, `kind`, `order_id`, `description`, `balance_before`, `balance_after`, `updated_at`, `created_at`) values (3, 17, 'debit', 'completed', 'seller_purchase', 3, 'Purchase for order #3', 288.08, 271.08, '2026-05-13 13:43:20', '2026-05-13 13:43:20')
update `seller` set `wallet_balance` = 271.08, `seller`.`updated_at` = '2026-05-13 13:43:20' where `id` = 3

        if (in_array($order->status, [Order::STATUS_PENDING, Order::STATUS_PENDING_PAYMENT], true)) {
            $order->status = Order::STATUS_PROCESSING;
        }
        $order->save();
---
update `orders` set `status` = 'processing', `seller_make_order_at` = '2026-05-13 13:43:20', `orders`.`updated_at` = '2026-05-13 13:43:20' where `id` = 3