packages/Webkul/Admin/src/Http/Controllers/Seller/WalletController.php

    public function index()
    {
        /** @var Admin $seller */
        $seller = Auth::guard('admin')->user();
        $walletType = (string) request()->query('wallet_type', 'all');

        $totalCredits = SellerWalletTransaction::query()
            ->where('seller_id', $seller->id)
            ->where('type', 'credit')
            ->where('status', SellerWalletTransaction::STATUS_COMPLETED)
            ->sum('amount');

        $transactionsQuery = SellerWalletTransaction::query()
            ->where('seller_id', $seller->id)
            ->latest();

        if ($walletType === 'deposit') {
            $transactionsQuery->where('type', 'credit');
        } elseif ($walletType === 'withdraw') {
            $transactionsQuery->where('type', 'debit');
        } else {
            $walletType = 'all';
        }

        $transactions = $transactionsQuery
            ->paginate(10)
            ->withQueryString();

        $depositMethods = SellerDepositMethodConfig::query()
            ->where('is_active', true)
            ->orderBy('sort_order')
            ->get();
---
select sum(`amount`) as aggregate from `seller_wallet_transactions` where `seller_id` = 3 and `type` = 'credit' and `status` = 'completed'
select * from `seller_wallet_transactions` where `seller_id` = 3 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `seller_wallet_transactions` where `seller_id` = 3
select * from `seller_deposit_method_configs` where `is_active` = 1 order by `sort_order` asc

    protected function resolveDepositDisplayAddresses($depositMethods): array
    {
        $map = config('seller-wallet.deposit_method_to_crypto_network', []);
        $bankCodes = config('seller-wallet.bank_deposit_method_codes', ['BANK_CARD']);

        $byNetworkType = CryptoPayoutAddress::query()
            ->orderBy('id')
            ->get()
            ->groupBy('network_type')
            ->map(fn ($group) => $group->first());
---
select * from `crypto_payout_addresses` order by `id` asc