packages/Webkul/Admin/src/Http/Controllers/Sales/OrderController.php

select distinct `order_payment`.`method` from `order_payment` inner join `orders` on `orders`.`id` = `order_payment`.`order_id` where `orders`.`seller_id` = 3
---
    protected function sellerPaymentMethodFilterOptions(): array
    {
        $seller = auth()->guard('admin')->user();

        if (! $seller instanceof Admin) {
            return [['value' => '', 'label' => trans('admin::app.seller-panel.filters.all')]];
        }

        $platformRoleIds = config('seller-panel.platform_admin_role_ids', []);
        $isPlatformAdmin = $seller->role
            && $seller->role->permission_type === 'all'
            && $platformRoleIds !== []
            && in_array((int) $seller->role_id, $platformRoleIds, true);

        $methodsQuery = DB::table('order_payment')
            ->join('orders', 'orders.id', '=', 'order_payment.order_id');

        if (! $isPlatformAdmin) {
            $methodsQuery->where('orders.seller_id', $seller->id);
        }

        $methods = $methodsQuery
            ->distinct()
            ->pluck('order_payment.method')
            ->filter()
            ->values();