packages/Webkul/Admin/src/Http/Controllers/Sales/RefundController.php

    public function index()
    {
        if (request()->ajax()) {
            return datagrid(OrderRefundDataGrid::class)->process();
        }

        $refundStateOptions = DB::table('refunds')
            ->select('state')
            ->whereNotNull('state')
            ->where('state', '!=', '')
            ->distinct()
            ->orderBy('state')
            ->pluck('state')
            ->values()
            ->all();
---
select distinct `state` from `refunds` where `state` is not null and `state` != '' order by `state` asc