packages/Webkul/SuperAdmin/src/Helpers/Reporting/Customer.php

select count(*) as aggregate from `customers` where `channel_id` in (1) and `created_at` between '2026-05-10 00:00:00' and '2026-05-10 23:59:59'
---
    public function getTotalCustomers($startDate, $endDate): int
    {
        return $this->customerRepository
            ->resetModel()
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('created_at', [$startDate, $endDate])
            ->count();