packages/Webkul/SuperAdmin/src/Helpers/Reporting/Sale.php

select count(*) as aggregate from `orders` where `channel_id` in (1) and `created_at` between '2026-05-10 00:00:00' and '2026-05-10 23:59:59'
---
    public function getTotalOrders($startDate, $endDate): int
    {
        return $this->orderRepository
            ->resetModel()
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('created_at', [$startDate, $endDate])
            ->count();

select * from `orders` where `channel_id` in (1) and `orders`.`created_at` between '2026-05-11 00:00:00' and '2026-05-11 23:59:59'
---
    public function getTodayOrders()
    {
        return $this->orderRepository
            ->resetModel()
            ->with(['addresses', 'payment', 'items'])
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('orders.created_at', [now()->today(), now()->endOfDay()])
            ->get();

select sum(base_grand_total_invoiced - base_grand_total_refunded) as aggregate from `orders` where `channel_id` in (1) and `created_at` between '2026-05-10 00:00:00' and '2026-05-10 23:59:59'
---
    public function getTotalSales($startDate, $endDate): float
    {
        return $this->orderRepository
            ->resetModel()
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('created_at', [$startDate, $endDate])
            ->sum(DB::raw('base_grand_total_invoiced - base_grand_total_refunded'));