packages/Webkul/SuperAdmin/src/Helpers/Reporting/Visitor.php

select * from `visits` where `visitable_id` is null and `channel_id` in (1) and `created_at` between '2026-05-11 00:00:00' and '2026-05-11 23:59:59'
---
    public function getTotalVisitors($startDate, $endDate, $visitableType = null): int
    {
        if ($visitableType) {
            return $this->visitRepository
                ->resetModel()
                ->where('visitable_type', $visitableType)
                ->whereIn('channel_id', $this->channelIds)
                ->whereBetween('created_at', [$startDate, $endDate])
                ->get()
                ->count();
        }

        return $this->visitRepository
            ->resetModel()
            ->whereNull('visitable_id')
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('created_at', [$startDate, $endDate])
            ->get()
            ->count();