packages/Webkul/Product/src/Type/AbstractType.php

    public function getCustomerGroupPricingOffers()
    {
        $offerLines = [];

        $customerGroup = $this->customerRepository->getCurrentGroup();

        $customerGroupPrices = $this->product->customer_group_prices()->where(function ($query) use ($customerGroup) {
            $query->where('customer_group_id', $customerGroup->id)
                ->orWhereNull('customer_group_id');
        })
            ->where('qty', '>', 1)
            ->groupBy('qty')
            ->orderBy('qty')
            ->get();
---
select * from `product_customer_group_prices` where `product_customer_group_prices`.`product_id` = 1 and `product_customer_group_prices`.`product_id` is not null and (`customer_group_id` = 2 or `customer_group_id` is null) and `qty` > 1 group by `qty` order by `qty` asc