packages/Webkul/SuperAdmin/src/Support/SuperAdminDashboardStats.php

select count(*) as aggregate from `products`
---
    public static function build(Dashboard $dashboard, VisitorReporting $visitorReporting): array
    {
        $today = $dashboard->getTodayStats();
        $start = $dashboard->getStartDate();
        $end = $dashboard->getEndDate();

        $channelIds = self::resolveChannelIds();

        $totalProducts = (int) Product::query()->count();

select count(*) as aggregate from `seller` where `status` in (1, '1')
---
    protected static function countActiveSellers(): int
    {
        if (! Schema::hasTable('seller')) {
            return 0;
        }

        $excludeRoleIds = collect(config('seller-panel.platform_admin_role_ids', []))
            ->map(fn ($id) => (int) $id)
            ->filter(fn (int $id) => $id > 0)
            ->unique()
            ->values()
            ->all();

        $q = DB::table('seller')->whereIn('status', [1, '1']);

        if ($excludeRoleIds !== []) {
            $q->where(function ($w) use ($excludeRoleIds) {
                $w->whereNull('role_id')
                    ->orWhereNotIn('role_id', $excludeRoleIds);
            });
        }

        return (int) $q->count();

select count(*) as aggregate from `customers` where `status` in (1, '1') and `is_suspended` = 0 and (`customers`.`customer_group_id` is null or exists (select 1 from `customer_groups` as `cg` where `cg`.`id` = `customers`.`customer_group_id` and `cg`.`code` != 'guest'))
---
    protected static function countActiveBuyers(): int
    {
        if (! Schema::hasTable('customers')) {
            return 0;
        }

        $q = DB::table('customers')
            ->whereIn('status', [1, '1']);

        if (Schema::hasColumn('customers', 'is_suspended')) {
            $q->where('is_suspended', 0);
        }

        if (Schema::hasTable('customer_groups') && Schema::hasColumn('customers', 'customer_group_id')) {
            $q->where(function ($w) {
                $w->whereNull('customers.customer_group_id')
                    ->orWhereExists(function ($sub) {
                        $sub->select(DB::raw(1))
                            ->from('customer_groups as cg')
                            ->whereColumn('cg.id', 'customers.customer_group_id')
                            ->where('cg.code', '!=', 'guest');
                    });
            });
        }

        return (int) $q->count();

select oi.product_id,
MAX(oi.name) as name,
COUNT(DISTINCT o.id) as orders_count,
AVG(oi.base_price) as avg_base_price from `order_items` as `oi` inner join `orders` as `o` on `oi`.`order_id` = `o`.`id` where `oi`.`parent_id` is null and `o`.`channel_id` in (1) and `o`.`created_at` between '2026-04-11 00:00:00' and '2026-05-11 21:17:27' group by `oi`.`product_id` having COUNT(DISTINCT o.id) > 0 order by `orders_count` desc limit 10
---
    protected static function topProductsByDistinctOrderCount(array $channelIds, $start, $end, int $limit): Collection
    {
        if ($channelIds === []) {
            return collect();
        }

        $prefix = DB::getTablePrefix();

        $rows = DB::table('order_items as oi')
            ->join('orders as o', 'oi.order_id', '=', 'o.id')
            ->whereNull('oi.parent_id')
            ->whereIn('o.channel_id', $channelIds)
            ->whereBetween('o.created_at', [$start, $end])
            ->groupBy('oi.product_id')
            ->selectRaw(
                'oi.product_id,
                MAX(oi.name) as name,
                COUNT(DISTINCT '.$prefix.'o.id) as orders_count,
                AVG('.$prefix.'oi.base_price) as avg_base_price'
            )
            ->havingRaw('COUNT(DISTINCT '.$prefix.'o.id) > 0')
            ->orderByDesc('orders_count')
            ->limit($limit)
            ->get();