packages/Webkul/Shop/src/Http/Controllers/ProductsCategoriesProxyController.php

select `products`.*, `product_relations`.`parent_id` as `pivot_parent_id`, `product_relations`.`child_id` as `pivot_child_id` from `products` inner join `product_relations` on `products`.`id` = `product_relations`.`child_id` where `product_relations`.`parent_id` = 1 and exists (select * from `product_flat` where `products`.`id` = `product_flat`.`product_id` and `channel` = 'default' and `locale` = 'en' and `status` = 1 and `visible_individually` = 1) limit 12
---
    protected function productViewPayload(ProductContract $product, object $tikStoreDisplay): array
    {
        $reviewHelper = app(ReviewHelper::class);
        $productViewHelper = app(ProductViewHelper::class);

        $avgRatings = $reviewHelper->getAverageRating($product);
        $customAttributeValues = $productViewHelper->getAdditionalData($product);
        $attributeData = collect($customAttributeValues)->filter(fn ($item) => ! empty($item['value']));
        $reviewTotalFeedback = $reviewHelper->getTotalFeedback($product);
        $reviewTotalReviews = $reviewHelper->getTotalReviews($product);

        $productReviews = $product->approvedReviews()
            ->with('images')
            ->latest()
            ->limit(50)
            ->get();

        $channelCode = core()->getCurrentChannelCode();
        $locale = app()->getLocale();

        $relatedProducts = $product->related_products()
            ->whereHas('product_flats', function ($query) use ($channelCode, $locale) {
                $query->where('channel', $channelCode)
                    ->where('locale', $locale)
                    ->where('status', 1)
                    ->where('visible_individually', 1);
            })
            ->limit(12)
            ->get();