packages/Webkul/Shop/src/Http/Controllers/TikStoreController.php

    protected function wishlistedProductIds(): array
    {
        if (! auth()->guard('customer')->check()) {
            return [];
        }

        return auth()->guard('customer')->user()
            ->wishlist_items()
            ->where('channel_id', core()->getCurrentChannel()->id)
            ->pluck('product_id')
            ->all();
---
select `product_id` from `wishlist_items` where `wishlist_items`.`customer_id` = 1 and `wishlist_items`.`customer_id` is not null and `channel_id` = 1

    protected function enrichCartMeta(Collection $rows): Collection
    {
        $productIds = $rows->pluck('product_id')->map(fn ($id) => (int) $id)->filter()->unique()->values()->all();

        if ($productIds === []) {
            return $rows;
        }

        $types = DB::table('products')
            ->whereIn('id', $productIds)
            ->pluck('type', 'id');

        $defaultVariants = DB::table('products')
            ->whereIn('parent_id', $productIds)
            ->where('type', 'simple')
            ->selectRaw('parent_id, MIN(id) as variant_id')
            ->groupBy('parent_id')
            ->pluck('variant_id', 'parent_id');
---
select `type`, `id` from `products` where `id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select parent_id, MIN(id) as variant_id from `products` where `parent_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10) and `type` = 'simple' group by `parent_id`