packages/Webkul/Shop/src/Providers/ShopServiceProvider.php

select * from `home_page_media` where `is_active` = 1 order by `sort_order` asc, `id` asc
---
            if ($view->name() === 'shop::landing.index' && ! array_key_exists('landingHeroMedia', $view->getData())) {
                $view->with(
                    'landingHeroMedia',
                    HomePageMedia::query()
                        ->where('is_active', true)
                        ->orderBy('sort_order')
                        ->orderBy('id')
                        ->get()
                );