packages/Webkul/SuperAdmin/src/Services/AdminReferralCodeService.php

    public function ensureExists(): string
    {
        $value = CoreConfig::query()->where('code', self::CONFIG_CODE)->value('value');
---
select `value` from `core_config` where `code` = 'general.superadmin.referral_code' limit 1