packages/Webkul/Sales/src/Models/Order.php

select * from `addresses` where `addresses`.`order_id` = 18 and `addresses`.`order_id` is not null and `address_type` in ('order_billing', 'order_shipping')
---
    public function billing_address()
    {
        return $this->addresses
            ->where('address_type', OrderAddress::ADDRESS_TYPE_BILLING);

select * from `orders` where `orders`.`id` = 18 limit 1
---
    public function canInvoice(): bool
    {
        foreach ($this->items as $item) {
            if (
                $item->canInvoice()
                && ! in_array($item->order->status, [
                    self::STATUS_CLOSED,
                    self::STATUS_FRAUD,
                ])
            ) {

select sum(`base_adjustment_fee`) as aggregate from `refunds` where `refunds`.`order_id` = 18 and `refunds`.`order_id` is not null
---
    public function canRefund(): bool
    {
        foreach ($this->items as $item) {
            if (
                $item->qty_to_refund > 0
                && ! in_array($item->order->status, [
                    self::STATUS_CLOSED,
                    self::STATUS_FRAUD,
                ])
            ) {
                return true;
            }
        }

        if ($this->base_grand_total_invoiced - $this->base_grand_total_refunded - $this->refunds()->sum('base_adjustment_fee') > 0) {