packages/Webkul/Admin/src/Support/SellerDashboardStats.php

select count(distinct `product_id`) as aggregate from `seller_store_products` where `seller_id` = 3
---

        $totalProducts = 0;
        if (Schema::hasTable('seller_store_products')) {
            $totalProducts = (int) DB::table('seller_store_products')
                ->where('seller_id', $sellerId)
                ->distinct()
                ->count('product_id');

select `product_id` from `seller_store_products` where `seller_id` = 3
select avg(`rating`) as aggregate from `product_reviews` where `product_id` in (280970, 280971, 280972, 280974, 280975, 280976, 280977, 280978, 280979, 287546) and `status` = 'approved'
---

        $avgRating = null;
        if (Schema::hasTable('seller_store_products') && Schema::hasTable('product_reviews')) {
            $productIds = DB::table('seller_store_products')
                ->where('seller_id', $sellerId)
                ->pluck('product_id');
            if ($productIds->isNotEmpty()) {
                $avg = DB::table('product_reviews')
                    ->whereIn('product_id', $productIds)
                    ->where('status', 'approved')
                    ->avg('rating');

select
oi.product_id,
MAX(oi.name) as name,
SUM(oi.base_total_invoiced - oi.base_amount_refunded) as revenue,
SUM(oi.qty_invoiced - oi.qty_refunded) as qty_sold
from `order_items` as `oi` inner join `orders` as `o` on `oi`.`order_id` = `o`.`id` where `o`.`seller_id` = 3 and `oi`.`parent_id` is null and `oi`.`created_at` between '2026-04-12 00:00:00' and '2026-05-12 22:09:07' and `o`.`seller_approval_status` = 'approved' group by `oi`.`product_id` having SUM(oi.base_total_invoiced - oi.base_amount_refunded) > 0 order by `revenue` desc limit 10
---
    protected static function topSellingProducts(int $sellerId, Carbon $start, Carbon $end, int $limit): Collection
    {
        $q = DB::table('order_items as oi')
            ->join('orders as o', 'oi.order_id', '=', 'o.id')
            ->where('o.seller_id', $sellerId)
            ->whereNull('oi.parent_id')
            ->whereBetween('oi.created_at', [$start, $end]);

        if (Schema::hasColumn('orders', 'seller_approval_status')) {
            $q->where('o.seller_approval_status', 'approved');
        }

        $prefix = DB::getTablePrefix();

        $rows = $q
            ->groupBy('oi.product_id')
            ->selectRaw('
                oi.product_id,
                MAX(oi.name) as name,
                SUM('.$prefix.'oi.base_total_invoiced - '.$prefix.'oi.base_amount_refunded) as revenue,
                SUM('.$prefix.'oi.qty_invoiced - '.$prefix.'oi.qty_refunded) as qty_sold
            ')
            ->havingRaw('SUM('.$prefix.'oi.base_total_invoiced - '.$prefix.'oi.base_amount_refunded) > 0')
            ->orderByDesc('revenue')
            ->limit($limit)
            ->get();